the-this-pointer/timer-board-stm32f103/Core/Src/UserInterface.c
#include "UserInterface.h"
#include "stm32f1xx_hal.h"
#include "cmsis_os.h"
#include "eeprom.h"
#include <string.h>

#define UART_BUFF_SIZE	128
#define UART_START_PACKET   0x1B
#define UART_START_PACKET_2 0x1B

#define SCR_DIRTY_ARG(uih) uih->screenDirty = 1
#define SCR_DIRTY uih->screenDirty = 1
#define SCR_DIRTY_CLR uih->screenDirty = 0

extern I2C_HandleTypeDef hi2c1;
extern UART_HandleTypeDef huart1;
extern RTC_HandleTypeDef hrtc;
extern TimeList* timeList;
extern EEPROM_TimeList timeListData;
extern uint16_t VirtAddVarTab[256];
extern uint8_t g_timerEnabled;

uint16_t sleepTimeMSec;
osThreadId inputTaskHandle;
osThreadId uiTaskHandle;
osMessageQId inputQueueHandle;
osTimerId sleepTimerHandle;
osMutexId lcdMutexHandle;
UiHandle uih;
uint8_t g_uartSelectedPlan = INVALID_PLAN;

uint8_t g_uart_rx[UART_BUFF_SIZE];
uint8_t	g_menuActionsOffset = 0;
const char* g_menuActionIcons = "%#$!";
const char* g_timeModes = " DWM";
const char* g_weekDays[7] = {"Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun"};

#define ACT_OFST(a, b) \
	if (g_menuActionsOffset == 0) \
	{ \
		a; \
	} else { \
		b; \
	}

#define ACT_OFST_3(a, b, c) \
	if (g_menuActionsOffset == 0) \
	{ \
		a; \
	} else if (g_menuActionsOffset == 4) {\
		b; \
	} else { \
		c; \
	}


void UserInterface_Init()
{
	ssd1306_Init(&hi2c1);
	uih.currentPage = NULL;
	uih.currentMenu = NULL;
	uih.screenDirty = 0;
	uih.screenStatus = 1;
	
	osMutexDef(lcdMutex);
  lcdMutexHandle = osMutexCreate(osMutex(lcdMutex));

	// Sleep Timer
	osTimerDef(sleepTimer, SleepTimerCallback);
  sleepTimerHandle = osTimerCreate(osTimer(sleepTimer), osTimerOnce, NULL);
	xTimerChangePeriod(sleepTimerHandle, sleepTimeMSec / portTICK_PERIOD_MS, 100);
	xTimerStart(sleepTimerHandle, 100);

	// Input Queue
	osMessageQDef(inputQueue, 16, uint16_t);
  inputQueueHandle = osMessageCreate(osMessageQ(inputQueue), NULL);

	// Input Task
	osThreadDef(inputTask, StartInputTask, osPriorityNormal, 0, 128);
  inputTaskHandle = osThreadCreate(osThread(inputTask), NULL);

	// Ui Task
  osThreadDef(uiTask, StartUiTask, osPriorityBelowNormal, 0, 128);
  uiTaskHandle = osThreadCreate(osThread(uiTask), NULL);

	UserInterface_InitPages(&uih);
	
	/* Start receiving data */
  if(HAL_UART_Receive_DMA(&huart1, g_uart_rx, UART_BUFF_SIZE) != HAL_OK)
  {        
	  Error_Handler();
  }

  /* Disable Half Transfer Interrupt */
  __HAL_DMA_DISABLE_IT(huart1.hdmarx, DMA_IT_HT);
}

void UserInterface_ChangePage(UiHandle* uih, UiPagePtr page)
{	
	if (uih->currentPage != NULL && uih->currentPage->onLeave)
		uih->currentPage->onLeave(uih);
	
	uih->currentPage = page;
	g_menuActionsOffset = 0;
	
	if (uih->currentPage->onInit)
		uih->currentPage->onInit(uih);
	
	if (uih->currentPage->text && uih->currentPage->menu)
	{
		ssd1306_Fill(Black);
		ssd1306_SetCursor(5, 5);
		ssd1306_WriteString(uih->currentPage->text, Font_11x18, White);

		ssd1306_UpdateScreen(&hi2c1);
		osDelay(1000);
	}
	
	if (!uih->currentPage->menu)
	{
		uih->currentMenu = NULL;
	}
	
	ssd1306_Fill(Black);
	
	if (uih->currentPage->text && !uih->currentPage->menu)
	{
		ssd1306_SetCursor(5, 5);
		ssd1306_WriteString(uih->currentPage->text, Font_11x18, White);
		UserInterface_p_DrawActions(uih->currentPage->actionIcons);
	}
	
	if (uih->currentPage->menu)
	{
		uih->currentMenu = uih->currentPage->menu;
		ssd1306_SetCursor(5, 5);
		ssd1306_WriteString(uih->currentMenu->caption, Font_11x18, White);
		UserInterface_p_DrawActions(g_menuActionIcons);
	}
	
	SCR_DIRTY;
}

void UserInterface_HandleInput(UiHandle* uih, uint16_t input)
{
	if (!uih->currentPage)
		return;

	if (uih->currentPage->menu == NULL)
	{
		if (input == Key1_Pin) {
			uih->currentPage->onHandleInput(uih, Key1);
		}
		if (input == Key2_Pin) {
			uih->currentPage->onHandleInput(uih, Key2);
		}
		if (input == Key3_Pin) {
			uih->currentPage->onHandleInput(uih, Key3);
		}
		if (input == Key4_Pin) {
			uih->currentPage->onHandleInput(uih, Key4);
		}
	}
	else
	{
		if (input == Key1_Pin) {
			UserInterface_p_onHandleMenuInput(uih, Key1);
		}
		if (input == Key2_Pin) {
			UserInterface_p_onHandleMenuInput(uih, Key2);
		}
		if (input == Key3_Pin) {
			UserInterface_p_onHandleMenuInput(uih, Key3);
		}
		if (input == Key4_Pin) {
			UserInterface_p_onHandleMenuInput(uih, Key4);
		}
	}
}

void UserInterface_InitMenu(UiMenuPtr menu, const char* caption, void* prev, void* next, void* parent, void* parentPage, void* page, void* children, menuCallback callback)
{
	if (!menu)
		return;
	
	(menu)->caption = caption;
	(menu)->prev = prev;
	(menu)->next = next;
	(menu)->parent = parent;
	(menu)->parentPage = parentPage;
	(menu)->page = page;
	(menu)->children = children;
	(menu)->callback = callback;
}

uint8_t UserInterface_Update(UiHandle* uih, uint32_t since)
{
	xSemaphoreTake(lcdMutexHandle, portMAX_DELAY);
	if (uih->currentPage && uih->currentPage->onUpdate && uih->screenStatus)
	{
		xSemaphoreGive(lcdMutexHandle);
		return uih->currentPage->onUpdate(uih, since);
	}
	xSemaphoreGive(lcdMutexHandle);
	return 0;
	// SCR_DIRTY;
}

void UserInterface_Flush(UiHandle* uih)
{
	xSemaphoreTake(lcdMutexHandle, portMAX_DELAY);
	if (!uih->screenDirty || !uih->screenStatus) {
		xSemaphoreGive(lcdMutexHandle);
		return;
	}
	xSemaphoreGive(lcdMutexHandle);

	ssd1306_UpdateScreen(&hi2c1);
	SCR_DIRTY_CLR;
}

void UserInterface_TurnOnScreen(UiHandle* uih)
{
	xSemaphoreTake(lcdMutexHandle, portMAX_DELAY);
	if (uih->screenStatus == 0) 
	{
		uih->screenStatus = 1;
		UserInterface_ChangePage(uih, &uih->pages[0]);
	}
	xSemaphoreGive(lcdMutexHandle);
}

void UserInterface_TurnOffScreen(UiHandle* uih)
{
	if (uih->screenStatus == 1) 
	{
		uih->screenStatus = 0;
		
		ssd1306_Fill(Black);
		ssd1306_UpdateScreen(&hi2c1);
		SCR_DIRTY_CLR;
	}
}

uint8_t UserInterface_ScreenIsOn(UiHandle* uih)
{
	return uih->screenStatus;
}

void UserInterface_p_DrawMenu(UiHandle* uih)
{
	if (!uih->currentMenu)
		return;
  ssd1306_Fill(Black);
	ssd1306_SetCursor(5, 5);
	ssd1306_WriteString(uih->currentMenu->caption, Font_11x18, White);
	UserInterface_p_DrawActions(g_menuActionIcons);
	SCR_DIRTY;
}

