the-this-pointer/timer-board-stm32f103/Core/Src/UserInterface.c
void UserInterface_p_onHandleMenuInput(UiHandle* uih, enum ActionType action)
{
	switch(action)
	{
		case Key1:
			if (uih->currentMenu->parent != NULL)
				uih->currentMenu = uih->currentMenu->parent;
			else if (uih->currentMenu->parentPage)
				((UiPagePtr)uih->currentMenu->parentPage)->onHandleInput(uih, Key1);
			break;
		case Key2:
			if (uih->currentMenu->prev != NULL)
				uih->currentMenu = uih->currentMenu->prev;
			break;
		case Key3:
			if (uih->currentMenu->next != NULL)
				uih->currentMenu = uih->currentMenu->next;
			break;
		case Key4:
		{
			if (uih->currentMenu->callback != NULL)
			{
				ssd1306_Fill(Black);
				ssd1306_SetCursor(5, 5);
				ssd1306_WriteString("Executing...", Font_11x18, White);
				ssd1306_UpdateScreen(&hi2c1);
				osDelay(500);

				uih->currentMenu->callback();
				
				ssd1306_Fill(Black);
				ssd1306_SetCursor(5, 5);
				ssd1306_WriteString("Done", Font_11x18, White);
				ssd1306_UpdateScreen(&hi2c1);
				osDelay(1000);
			}
			else if (uih->currentMenu->children != NULL)
			{
				uih->currentMenu = uih->currentMenu->children;
			}
			else if (uih->currentMenu->page != NULL)
			{
				UserInterface_ChangePage(uih, uih->currentMenu->page);
			}
			break;
		}
	}
	
	UserInterface_p_DrawMenu(uih);
}

void UserInterface_p_DrawActions(const char* actions)
{
	if (actions == NULL || strlen(actions) < 4)
		return;
	
	if (actions[g_menuActionsOffset+0] != ' ')
	{
		ssd1306_SetCursor(5, 40);
		ssd1306_WriteChar(actions[g_menuActionsOffset+0], Icon_11x18, White);
	}
	if (actions[g_menuActionsOffset+1] != ' ')
	{
		ssd1306_SetCursor(40, 40);
		ssd1306_WriteChar(actions[g_menuActionsOffset+1], Icon_11x18, White);
	}
	if (actions[g_menuActionsOffset+2] != ' ')
	{
		ssd1306_SetCursor(75, 40);
		ssd1306_WriteChar(actions[g_menuActionsOffset+2], Icon_11x18, White);
	}
	if (actions[g_menuActionsOffset+3] != ' ')
	{
		ssd1306_SetCursor(110, 40);
		ssd1306_WriteChar(actions[g_menuActionsOffset+3], Icon_11x18, White);
	}
}



// Page Callbacks

void UserInterface_InitPages(UiHandle* uih)
{
	uih->pages = malloc(sizeof(UiPage) * MaxPages);
	if (!uih->pages)
		return;
	
	/* Init Main Page */
	uih->pages[MainPageIdx].text = "Main Page";
	uih->pages[MainPageIdx].actionIcons = "&  )";
	uih->pages[MainPageIdx].onInit = NULL;
	uih->pages[MainPageIdx].onUpdate = mainPageUpdateCallback;
	uih->pages[MainPageIdx].onLeave = NULL;
	uih->pages[MainPageIdx].onHandleInput = mainPageInputCallback;
	uih->pages[MainPageIdx].data = NULL;

	/* Init Time List Page And Menus */
	TimeListPageData* timeListData = malloc(sizeof(TimeListPageData));	
	timeListData->plan = NULL;
	timeListData->showingItem = NULL;

	uih->pages[TimeListPageIdx].text = "Time List";
	uih->pages[TimeListPageIdx].menu = NULL;
	uih->pages[TimeListPageIdx].actionIcons = "%#$**+-**,. ";
	uih->pages[TimeListPageIdx].onInit = timeListPageOnInitCallback;
	uih->pages[TimeListPageIdx].onUpdate = timeListPageUpdateCallback;
	uih->pages[TimeListPageIdx].onLeave = timeListPageOnLeaveCallback;
	uih->pages[TimeListPageIdx].onHandleInput = timeListPageInputCallback;
	uih->pages[TimeListPageIdx].data = timeListData;

	/* Add Time Plan Page And Menus */
	AddTimePlanPageData* addTimePlanData = malloc(sizeof(AddTimePlanPageData));
	addTimePlanData->editingPlan = NULL;

	uih->pages[AddTimePlanPageIdx].text = "Time Plan";
	uih->pages[AddTimePlanPageIdx].menu = NULL;
	uih->pages[AddTimePlanPageIdx].actionIcons = "%('!";
	uih->pages[AddTimePlanPageIdx].onInit = addTimePlanPageOnInitCallback;
	uih->pages[AddTimePlanPageIdx].onUpdate = addTimePlanPageUpdateCallback;
	uih->pages[AddTimePlanPageIdx].onLeave = NULL;
	uih->pages[AddTimePlanPageIdx].onHandleInput = addTimePlanPageInputCallback;
	uih->pages[AddTimePlanPageIdx].data = addTimePlanData;

	/* Add Timer Item Page And Menus */
	AddTimerItemPageData* addTimerItemData = malloc(sizeof(AddTimerItemPageData));
	addTimerItemData->plan = NULL;
	addTimerItemData->editingItem = NULL;

	uih->pages[AddTimerItemPageIdx].text = "Timer Item";
	uih->pages[AddTimerItemPageIdx].menu = NULL;
	uih->pages[AddTimerItemPageIdx].actionIcons = "%('!";
	uih->pages[AddTimerItemPageIdx].onInit = addTimerItemPageOnInitCallback;
	uih->pages[AddTimerItemPageIdx].onUpdate = addTimerItemPageUpdateCallback;
	uih->pages[AddTimerItemPageIdx].onLeave = NULL;
	uih->pages[AddTimerItemPageIdx].onHandleInput = addTimerItemPageInputCallback;
	uih->pages[AddTimerItemPageIdx].data = addTimerItemData;

	/* Init Settings Page And Menus */
	enum settingMenuTypes {
		MNU_SET_TIME = 0x00,
		MNU_SLP_TIME,
		MNU_CNT
	};
	UiMenuPtr settingMenus = (UiMenuPtr)malloc(sizeof(UiMenu) * MNU_CNT);
	if (!settingMenus)
		return;
	UserInterface_InitMenu(&settingMenus[MNU_SET_TIME], "Time", 					NULL, &settingMenus[MNU_SLP_TIME], NULL, &uih->pages[SettingPageIdx], &uih->pages[SetTimePageIdx], NULL, NULL);
	UserInterface_InitMenu(&settingMenus[MNU_SLP_TIME], "Sleep Time", 		&settingMenus[MNU_SET_TIME], NULL, NULL, &uih->pages[SettingPageIdx], &uih->pages[SetSleepTimePageIdx], NULL, NULL);
	
	uih->pages[SettingPageIdx].text = "Settings";
	uih->pages[SettingPageIdx].menu = settingMenus;
	uih->pages[SettingPageIdx].actionIcons = NULL;
	uih->pages[SettingPageIdx].onInit = NULL;
	uih->pages[SettingPageIdx].onUpdate = NULL;
	uih->pages[SettingPageIdx].onLeave = NULL;
	uih->pages[SettingPageIdx].onHandleInput = settingsPageInputCallback;
	uih->pages[SettingPageIdx].data = NULL;

	/* Init Set Time Page And Data */
	
	RTC_TimeTypeDef *sTime = malloc(sizeof(RTC_TimeTypeDef));
	if (HAL_RTC_GetTime(&hrtc, sTime, RTC_FORMAT_BCD) != HAL_OK)
	{
		Error_Handler();
	}

	RTC_DateTypeDef *sDate = malloc(sizeof(RTC_DateTypeDef));
	if (HAL_RTC_GetDate(&hrtc, sDate, RTC_FORMAT_BCD) != HAL_OK)
	{
		Error_Handler();
	}

	SetTimePageData* setTimeData = malloc(sizeof(SetTimePageData));	
	setTimeData->sTime = sTime;
	setTimeData->sDate = sDate;
	
	uih->pages[SetTimePageIdx].text = NULL;
	uih->pages[SetTimePageIdx].actionIcons = "%('!";
	uih->pages[SetTimePageIdx].onInit = setTimePageOnInitCallback;
	uih->pages[SetTimePageIdx].onUpdate = setTimePageUpdateCallback;
	uih->pages[SetTimePageIdx].onLeave = NULL;
	uih->pages[SetTimePageIdx].onHandleInput = setTimePageInputCallback;
	uih->pages[SetTimePageIdx].data = setTimeData;

	/* Init Set Sleep Time Page And Data */

	SetSleepTimePageData* setSleepTimeData = malloc(sizeof(SetSleepTimePageData));	
	setSleepTimeData->sleepTime = 0;
	
	uih->pages[SetSleepTimePageIdx].text = NULL;
	uih->pages[SetSleepTimePageIdx].actionIcons = "%('!";
	uih->pages[SetSleepTimePageIdx].onInit = setSleepTimePageOnInitCallback;
	uih->pages[SetSleepTimePageIdx].onUpdate = setSleepTimePageUpdateCallback;
	uih->pages[SetSleepTimePageIdx].onLeave = NULL;
	uih->pages[SetSleepTimePageIdx].onHandleInput = setSleepTimePageInputCallback;
	uih->pages[SetSleepTimePageIdx].data = setSleepTimeData;

	/* Init Message Popup And Data */
	
	MessagePopupData* msgPopupData = malloc(sizeof(MessagePopupData));
	msgPopupData->secondCounter = 0;
	msgPopupData->secondsToShow = 0;
	msgPopupData->fallbackPage = NULL;
	
