the-this-pointer/timer-board-stm32f103/Core/Src/UserInterface.c
	uih->pages[MessagePopupIdx].text = NULL;
	uih->pages[MessagePopupIdx].actionIcons = "";
	uih->pages[MessagePopupIdx].onInit = messagePopupOnInitCallback;
	uih->pages[MessagePopupIdx].onUpdate = messagePopupUpdateCallback;
	uih->pages[MessagePopupIdx].onLeave = NULL;
	uih->pages[MessagePopupIdx].onHandleInput = messagePopupInputCallback;
	uih->pages[MessagePopupIdx].data = msgPopupData;


	UserInterface_ChangePage(uih, &uih->pages[MainPageIdx]);
}

void UserInterface_ShowPopup(UiHandle* uih, const char* text, uint8_t secondsToShow, UiPagePtr fallbackPage)
{
	if (fallbackPage == NULL)
		fallbackPage = uih->currentPage;
	
	MessagePopupData* popupData = uih->pages[MessagePopupIdx].data;
	popupData->secondsToShow = secondsToShow;
	popupData->fallbackPage = fallbackPage;
	uih->pages[MessagePopupIdx].text = text;
	UserInterface_ChangePage(uih, &uih->pages[MessagePopupIdx]);
}

void StartInputTask(void const * argument)
{
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
	BaseType_t xResult;
	uint16_t counter = 0;
	uint16_t value = 0;
	uint8_t dataAvailable = 0;
	uint8_t rxDataCount = 0;
  for(;;)
  {
		// reading settings from uart
		/**
		* packet is something like:
		* byte 0..1: packet start bytes (hardcoded values)
		* byte 2: packet size [limited by 8-bits minus start packets and size bytes (3)], more than this limit will be ignored!
		*/

		rxDataCount = UART_BUFF_SIZE - huart1.hdmarx->Instance->CNDTR;
		if (rxDataCount > 3 && g_uart_rx[0] == UART_START_PACKET && g_uart_rx[1] == UART_START_PACKET_2)
		{
			uint8_t resetDma = 0x00;
			uint8_t packetSize = g_uart_rx[2];
			if (packetSize > rxDataCount + 3)
			{
				// the whole packet not received yet, or maybe maximmum bytes received by dma!
				if (rxDataCount == UART_BUFF_SIZE)
				{
					// packet is larger than the buffer and we are unable to get the rest of data, just ignore data and start over
					resetDma = 0x01;
				}
				/**
				*else
				*{
				*	wait for the rest of data
				*}
				*/
			}
			else
			{
				resetDma = 0x01;
				processUartCommand((const char*)(g_uart_rx + 3), rxDataCount);
			}
			
			if (resetDma)
			{
				HAL_UART_DMAStop(&huart1);
				HAL_UART_Receive_DMA(&huart1, g_uart_rx, UART_BUFF_SIZE);
				resetDma = 0x00;
			}
			
			vTaskDelay( 10 );
			continue;
		}
		
		// end reading settings from uart
		
		
		if (counter > 35)
			counter = 35;
		
		if (HAL_GPIO_ReadPin(Key1_GPIO_Port, Key1_Pin) == GPIO_PIN_SET) {
			value = Key1_Pin;
			dataAvailable = 1;
		}
		else if (HAL_GPIO_ReadPin(Key2_GPIO_Port, Key2_Pin) == GPIO_PIN_SET) {
			value = Key2_Pin;
			dataAvailable = 1;
		}
		else if (HAL_GPIO_ReadPin(Key3_GPIO_Port, Key3_Pin) == GPIO_PIN_SET) {
			value = Key3_Pin;
			dataAvailable = 1;
		}
		else if (HAL_GPIO_ReadPin(Key4_GPIO_Port, Key4_Pin) == GPIO_PIN_SET) {
			value = Key4_Pin;
			dataAvailable = 1;
		}
		else if (counter > 0) {
			counter = 0;
		}
		
		if (dataAvailable)
		{
			if (!UserInterface_ScreenIsOn(&uih))
				UserInterface_TurnOnScreen(&uih);
			else
			{
				xResult = xQueueSendToBack(inputQueueHandle, (const void *)&value, pdMS_TO_TICKS(50));
				counter += 5;
			}
			xTimerReset(sleepTimerHandle, 100);
			dataAvailable = 0;
			vTaskDelay(pdMS_TO_TICKS(400 - counter * 10));
		}

    vTaskDelay( 100 );
  }
  /* USER CODE END 5 */
}

void StartUiTask(void const * argument)
{
  /* USER CODE BEGIN StartUiTask */
  /* Infinite loop */
	TickType_t xLastUpdateTime = xTaskGetTickCount();
	TickType_t xNow = xTaskGetTickCount();
	uint16_t xReceivedInput;
	BaseType_t xResult;
	for(;;)
  {
    xResult = xQueueReceive(inputQueueHandle, &xReceivedInput, pdMS_TO_TICKS(50) );
		if( xResult == pdPASS )
		{
			UserInterface_HandleInput(&uih, xReceivedInput);
		}
		xNow = xTaskGetTickCount();
		
		if (UserInterface_Update(&uih, xNow - xLastUpdateTime))
			xLastUpdateTime = xTaskGetTickCount();
		
		UserInterface_Flush(&uih);
    vTaskDelay( 100 );
  }
  /* USER CODE END StartUiTask */
}

void SleepTimerCallback(void const * argument)
{
  /* USER CODE BEGIN SleepTimerCallback */
	UserInterface_TurnOffScreen(&uih);
  /* USER CODE END SleepTimerCallback */
}


uint8_t mainPageUpdateCallback(void* uih, uint32_t since)
{
	if (since < 400)
		return 0;
	
	UiHandle* hnd = uih;
	RTC_TimeTypeDef sTime = {0};
  RTC_DateTypeDef sDate = {0};

	if (HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BCD) != HAL_OK)
	{
		Error_Handler();
	}
	
	if (HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BCD) != HAL_OK)
	{
		Error_Handler();
	}
	
	static int counter;
	counter++;
	char timeBuff[8] = {0};
	sprintf(timeBuff, "%02d:%02d", DecodeBCD(sTime.Hours), DecodeBCD(sTime.Minutes));
	
	char secBuff[8] = {0};
	sprintf(secBuff, "%02d", DecodeBCD(sTime.Seconds));

	char dateBuff[8] = {0};
	sprintf(dateBuff, "%02d/%02d", DecodeBCD(sDate.Month), DecodeBCD(sDate.Date));

	ssd1306_Fill(Black);
	ssd1306_SetCursor(16, 5);
	ssd1306_WriteString(timeBuff, Font_16x26, White);
	
	ssd1306_SetCursor(101, 13);
	ssd1306_WriteString(secBuff, Font_11x18, White);

	ssd1306_SetCursor(36, 35);
	ssd1306_WriteString(dateBuff, Font_11x18, White);

	UserInterface_p_DrawActions(hnd->currentPage->actionIcons);
	
	SCR_DIRTY_ARG(hnd);
	return 1;
}

void mainPageInputCallback(void* uih, enum ActionType action)
{
	switch(action)
	{
		case Key1:
			UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[SettingPageIdx]);
			break;
		case Key4:
			UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[TimeListPageIdx]);
			break;
		default:
			break;
	}
}

void timeListPageOnInitCallback(void* uih)
{
	UiHandle* hnd = uih;
	TimeListPageData* data = hnd->currentPage->data;

	Timer_Sort(timeList);
	
	data->plan = TimePlan_IsEmpty(&timeList->plans[0])? Timer_GetNextFullSlot(timeList, 0): &timeList->plans[0];
	data->screenIndex = 0;
	data->showingItem = NULL;
}

void timeListPageOnLeaveCallback(void* uih)
{
	Timer_Sort(timeList);
}

// use odd numbers if you don't want a blink between first screen update!
#define TIME_TO_SHOW_PLAN 5
uint8_t timeListPageUpdateCallback(void* uih, uint32_t since)
{
	if (since < 800)
		return 0;
	UiHandle* hnd = uih;
	TimeListPageData* data = hnd->currentPage->data;
			
	ssd1306_Fill(Black);
	if (data->plan == NULL)
	{
		ssd1306_SetCursor(5, 5);
		ssd1306_WriteString("Empty List!", Font_11x18, White);
		SCR_DIRTY_ARG(hnd);
	} else {
		char buff[16] = {0};

		if (data->screenIndex <= TIME_TO_SHOW_PLAN)
		{
			switch(data->plan->mode)
			{
				case Monthly:
					snprintf(buff, 16, "%c: %d", g_timeModes[data->plan->mode], data->plan->day);
					break;
				case Weekly:
					snprintf(buff, 16, "%c: %s", g_timeModes[data->plan->mode], g_weekDays[data->plan->day]);
					break;
				default:
					snprintf(buff, 16, "%c", g_timeModes[data->plan->mode]);
			}
	
