the-this-pointer/timer-board-stm32f103/Core/Src/UserInterface.c
	UiHandle* hnd = uih;
	SetSleepTimePageData* data = hnd->currentPage->data;
	
	ssd1306_Fill(Black);

	char timeBuff[8] = {0};
	snprintf(timeBuff, 8, "%d", data->sleepTime);
	
	ssd1306_SetCursor(5, 5);
	ssd1306_WriteString(timeBuff, Font_11x18, White);

	UserInterface_p_DrawActions(hnd->currentPage->actionIcons);
	SCR_DIRTY_ARG(hnd);
	return 1;
}

void setSleepTimePageInputCallback(void* uih, enum ActionType action)
{
	UiHandle* hnd = uih;
	SetSleepTimePageData* data = hnd->currentPage->data;

	switch(action)
	{
		case Key1:
			UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[SettingPageIdx]);
			break;
		case Key2:
			if (data->sleepTime == 6)
				data->sleepTime = 60;
			else
				data->sleepTime--;
			break;
		case Key3:
			if (data->sleepTime == 60)
				data->sleepTime = 6;
			else
				data->sleepTime++;
			break;
		case Key4:
			if (xTimerChangePeriod(sleepTimerHandle, data->sleepTime * 1000 / portTICK_PERIOD_MS, 100) == pdPASS && 
				EE_WriteVariable(VirtAddVarTab[0],  data->sleepTime * 1000) == HAL_OK)
			{
				sleepTimeMSec = data->sleepTime * 1000;
				UserInterface_ShowPopup(uih, "Time Set!", 3, &((UiHandle*)uih)->pages[SettingPageIdx]);
			}
			else
				Error_Handler();
			break;
		default:
			break;
	}
}

void messagePopupOnInitCallback(void* uih)
{
	UiHandle* hnd = uih;
	MessagePopupData* data = hnd->currentPage->data;

	data->secondCounter = 0;
}

uint8_t messagePopupUpdateCallback(void* uih, uint32_t since)
{
	if (since < 950)
		return 0;
	
	UiHandle* hnd = uih;
	MessagePopupData* data = hnd->currentPage->data;
	if (++data->secondCounter >= data->secondsToShow)
		UserInterface_ChangePage(uih, data->fallbackPage);
	
	return 1;
}

void messagePopupInputCallback(void* uih, enum ActionType action)
{
	UiHandle* hnd = uih;
	MessagePopupData* data = hnd->currentPage->data;

	UserInterface_ChangePage(uih, data->fallbackPage);
}

/* void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) 
{
  // if we receive bytes more than the buffer size, we will ignore them unless we may loose them...
  // HAL_UART_Receive_DMA(&huart1, g_uart_rx, UART_BUFF_SIZE);
} */

void processUartCommand(const char* data, uint8_t length)
{
	if (length < 4)
		return;
	
	uint8_t handled = 0x00;
	if (memcmp(data, "hlt;", 4) == 0)
	{
		// stop timer task (but outputs stay active with last values)
		g_timerEnabled = 0x00;
		handled = 0x01;
	}
	else if (memcmp(data, "stt;", 4) == 0)
	{
		// start timer task
		g_timerEnabled = 0x01;
		handled = 0x01;
	}
	else if (memcmp(data, "clr;", 4) == 0)
	{
		// clear all items
		Timer_TimeListInit(timeList);
		handled = 0x01;
	}
	else if (memcmp(data, "set;", 4) == 0)
	{
		// save all items
		Timer_SaveData(&timeListData);
		handled = 0x01;
	}
	else if (memcmp(data, "pln:", 4) == 0)
	{
		// select plan by index
		g_uartSelectedPlan = (uint8_t)data[4];
		if (g_uartSelectedPlan >= MAX_PLANS)
			g_uartSelectedPlan = INVALID_PLAN;
		handled = 0x01;
	}
	else if (memcmp(data, "tmr:", 4) == 0)
	{
		// timer item number and properties
		if (g_uartSelectedPlan == INVALID_PLAN)
			goto send_response;
		
		uint8_t timerItemIdx = data[4];
		if (timerItemIdx >= MAX_TIMES_PER_PLAN)
			goto send_response;
		
		uint8_t hours, minutes, status;
		hours = data[5];
		minutes = data[6];
		status = data[7];
		
		timeList->plans[g_uartSelectedPlan].items[timerItemIdx].hours = hours;
		timeList->plans[g_uartSelectedPlan].items[timerItemIdx].minutes = minutes;
		timeList->plans[g_uartSelectedPlan].items[timerItemIdx].status = status;
		handled = 0x01;
	}
	
	send_response:
	if (handled)
		HAL_UART_Transmit(&huart1, (uint8_t*)"ack;", 4, 10);
	else
		HAL_UART_Transmit(&huart1, (uint8_t*)"rej;", 4, 10);
}
